senior-research/notes/linear-classification.tex
% Created 2018-01-22 Mon 23:39
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Ankur Mishra}
\date{1/22/2018 -1/29/2017}
\title{Notes}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Classifiers}
\label{sec-1}
\subsection{Data Driven Approach}
\label{sec-1-1}
\begin{itemize}
\item Collect data from internet
\item Use ML to train an Model
\item Evaluate Model with test data
\end{itemize}
\subsection{Nearest Neighbor Classifier}
\label{sec-1-2}
\begin{itemize}
\item Finds objects that are similar using various functions such as Manhattan/Euclidean Distances and it finds shortest distance from them
\item Manahattan (L1) Distance: finds absolute value difference between test and training images
\item Euclidean (L2) Distance: finds distance by summing up square of difference between images
\item Distances are hyperparameters
\end{itemize}
\subsubsection{k-Nearest Neighbor}
\label{sec-1-2-1}
\begin{itemize}
\item Finds k nearest images, which has a vote for the label
\item k is a hyperparameters
\item Never used on images as it has awful test time and distance metrics are unintuitive
\end{itemize}
\subsection{Linear Classification}
\label{sec-1-3}
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}
